// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

Console.Write("Введите трёхзначное число ");
int num1 = Convert.ToInt32(Console.ReadLine());
if (num1 < 1000 && num1 >99)
{
    num1 = num1 / 10;
    num1 = num1 % 10;
    Console.Write($"Вторая цифра вашего числа: {num1}");
}
else
{
    Console.Write("Ошибка введите трёхзначное число ");
}